# Pandas Tratamiento de datos nulos o sin valo

In [1]:
import numpy as np
import pandas as pd

In [3]:
diccionario= {'A':[4,5,np.nan],'B':[4,3,6],'C':[4,np.nan,np.nan]}

In [4]:
dataframe = pd.DataFrame(diccionario)
dataframe

     A  B    C
0  4.0  4  4.0
1  5.0  3  NaN
2  NaN  6  NaN

In [5]:
#Elimina valores nulos shift + tab mas informacion
dataframe.dropna()

     A  B    C
0  4.0  4  4.0

In [6]:
#Elimina valores nulos por columnas
dataframe.dropna(axis=1)

   B
0  4
1  3
2  6

In [7]:
#Modificar datos NAN
dataframe.fillna(value=100)

       A  B      C
0    4.0  4    4.0
1    5.0  3  100.0
2  100.0  6  100.0

In [9]:
#Modificar con el valor medio 
valor_medio = dataframe.mean()
valor_medio

A    4.500000
B    4.333333
C    4.000000
dtype: float64

In [10]:
dataframe.fillna(value=valor_medio)

     A  B    C
0  4.0  4  4.0
1  5.0  3  4.0
2  4.5  6  4.0